controllers/SiteController.php

    public function actionRegister(){
        $model = new Logopedista();

        if ($model->load(Yii::$app->request->post())) {
            if ($model->validate()) {
                // form inputs are valid, do something here
                $model->email = $_POST['Logopedista']['email'];
                $model->passwd = password_hash($_POST['Logopedista']['passwd'], PASSWORD_DEFAULT);
                $model->nome = $_POST['Logopedista']['nome'];
                $model->cognome = $_POST['Logopedista']['cognome'];
                $model->indirizzo = $_POST['Logopedista']['indirizzo'];
                $model->telefono = $_POST['Logopedista']['telefono'];
                if($model->save()) {
---
INSERT INTO `logopedista` (`email`, `passwd`, `cognome`, `nome`, `indirizzo`, `telefono`) VALUES ('mariorossi@gmail.com', '$argon2i$v=19$m=65536,t=4,p=1$UksueVVZL3ZNeGk0UFV1WQ$MAEAax66AInx+puaPLkCLwE3mFbDNKSU/q++71Uth7o', 'Rossi', 'Mario', 'Via Roma, 1', '3338964524')