models/Logopedista.php

SELECT * FROM `logopedista` WHERE `email`='admin'
---
    public static function findByEmail($email){//nuova funzione messa da me
        return self::findOne(['email' => $email]);